DataProcessors/отчетПоСебе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>отчетПоСебе</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/РегистрНаставники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрНаставники</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прикреплен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стажеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Наставники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/Роли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>Роли</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наставник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стажер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/отчетПоСебе/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = МодульРаботыСПользователями.СведенияОПользователе();
	Запрос(ТекущийПользователь);
КонецПроцедуры

&НаСервере
Функция Запрос(ТекущийПользователь)
	Запрос = новый запрос;
	Если ТекущийПользователь.Роль = Перечисления.Роли.Администратор или ТекущийПользователь.Роль = Перечисления.Роли.Наставник Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегистрНаставники.Регистратор КАК Регистратор,
		               |	РегистрНаставники.Наставник КАК Наставник,
		               |	РегистрНаставники.Стажер КАК Стажер,
		               |	РегистрНаставники.МоментВремени КАК МоментВремени
		               |ИЗ
		               |	РегистрНакопления.РегистрНаставники КАК РегистрНаставники
					   |Где
					   |	Наставник = &Наставник";
		Запрос.УстановитьПараметр("Наставник", ТекущийПользователь.СсылкаНаСправочникНаставникСтажер.Наименование);
		
		Элементы.Приветствие.Заголовок = "Ваши закрепления со стажером";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегистрНаставники.Регистратор КАК Регистратор,
		               |	РегистрНаставники.Наставник КАК Наставник,
		               |	РегистрНаставники.Стажер КАК Стажер,
		               |	РегистрНаставники.МоментВремени КАК МоментВремени
		               |ИЗ
		               |	РегистрНакопления.РегистрНаставники КАК РегистрНаставники
					   |Где
					   |	Стажер = &Стажер";
		Запрос.УстановитьПараметр("Стажер", ТекущийПользователь.СсылкаНаСправочникНаставникСтажер);	
		
		Элементы.Приветствие.Заголовок = "Ваши закрепления с наставником";
	КонецЕсли;
	ответ = Запрос.Выполнить().Выгрузить();
	Реквизит1.Загрузить(ответ);
КонецФункции;
